"use strict";
const TEXT =
    "Он отпер дверь своим ключом и вошел, а следом, в смущении сдернув кепку, шагнул молодой парень. Что-то в его грубой одежде сразу же выдавало моряка, и в просторном холле, где они оказались, он был явно не к месту. Он не знал, куда девать кепку, стал было засовывать ее в карман пиджака, но тот, другой, отобрал ее. Отобрал спокойно, естественно, и парень, которому тут, видно, было не по себе, в душе поблагодарил его. «Понимает, – подумал он. – Поможет, все обойдется».\nПарень враскачку шел за тем, другим, невольно расставляя ноги, словно этот ровный пол то, кренясь, взмывал на волне, то ухал вниз. Шел вперевалку, и большие комнаты становились тесными, и страх его брал, как бы не задеть широкими плечами дверной косяк, не скинуть какую-нибудь дорогую вещицу с низкой каминной полки. Он шарахался то вправо, то влево и лишь умножал опасности, что мерещились ему на каждом шагу. Между роялем и столом посреди комнаты, на котором громоздились книги, могли бы пройти шестеро в ряд, он же пробирался с опаской. Могучие ручищи болтались по бокам. Он не знал, куда их девать, вдруг в страхе отпрянул, точно испуганная лошадь, – вообразил, будто сейчас свалит груду книг на столе, и едва не наскочил на вращающийся табурет перед роялем. Он приметил, какая непринужденная походка у того, впереди, и впервые осознал, что сам ходит совсем не как все прочие люди. И на миг устыдился своей неуклюжести. На лбу выступили капельки пота, он остановился, отер загорелое лицо платком.\n– Обождите, Артур, дружище, – сказал он, пытаясь прикрыть тревогу шутливым тоном. – У меня аж голова кругом пошла. Надо ж мне набраться храбрости. Сами знаете, не желал я идти, да и вашему семейству, смекаю, не больно я нужен.\n– Ничего-ничего, – ободряюще сказал Артур. – Незачем нас бояться. Мы самые обыкновенные люди. Э, да мне письмо!\nОн отошел к столу, вскрыл конверт и принялся читать, давая гостю опомниться. И гость понял и в душе поблагодарил хозяина. Был у него дар понимания, проникновения; и хотя чувствовалось, что ему сейчас отчаянно не по себе, дар этот ни на минуту не изменил ему. Он опять вытер лоб, осмотрелся, и теперь лицо уже было спокойно, только взгляд настороженный, словно у дикого зверя, когда он чует ловушку. Оказавшись в незнакомом окружении, со страхом думая, что же будет дальше, он не понимал как себя здесь вести, ощущал, что ходит и держится неуклюже, боялся, что каждое его движение, и сама его сила отдает все той же неуклюжестью. Был он на редкость чуток, безмерно застенчив, и затаенная усмешка во взгляде Артура, брошенном поверх письма резанула его как ножом. Он заметил этот взгляд, но виду не подал, ибо в ту науку, которую он превзошел, входило и умение владеть собой. Взгляд, этот ранил его гордость. Он клял себя за то, что пришел и, однако, решил, что, уж раз пришел, будь что будет, отступать он не намерен. Лицо стало жестче, глаза сверкнули воинственно. Все примечая, он спокойнее огляделся по сторонам, и в мозгу отпечаталась каждая мелочь красивого убранства этой комнаты. Ничто не ускользнуло от его зоркого взгляда, широко раскрытые глаза вбирали окружающую красоту, и воинственный блеск в них уступал место теплому сиянию. Он всегда чутко отзывался на красоту, а тут было на что отозваться.\nЕго внимание приковала картина, писанная маслом. Могучий прибой с грохотом разбивается о выступ скалы, мрачные грозовые тучи затянули небо, а вдали, за линией прибоя, на фоне грозового закатного неба – лоцманский бот в крутом повороте, он накренился, так что видна каждая мелочь на палубе. Была здесь красота, и она влекла неодолимо. Парень позабыл о своей неуклюжей походке, подошел ближе, совсем близко. И красота исчезла. На лице его выразилось замешательство. Он смотрел во все глаза на эту, как ему теперь казалось, неряшливую мазню, потом отступил на шаг. И полотно вновь ослепило красотой. «Картина с фокусом», – подумал он разочарованно, однако среди множества захлестнувших его впечатлений кольнула досада: такую красоту принесли в жертву фокусу. Живопись была ему неведома. Прежде он только и видел олеографии да литографии, а они всегда четки и определенны, стоишь ли рядом или смотришь издали. Правда, в витринах магазинов он видел и картины, писанные маслом, но стекло не давало всмотреться в них поближе.\nОн оглянулся на приятеля, читающего письмо, и увидел на столе книги. В глазах тотчас вспыхнула тоскливая зависть и жадность, точно у голодного при виде пищи. Враскачку он двинулся к столу и вот уже любовно перебирает книги. Скользит глазами по названиям, по именам авторов, выхватывает обрывки текста, – ласкает том за томом и руками и взглядом, – но лишь одну книгу он когда-то читал. Остальные книги и писатели незнакомы. Ему попался том Суинберна, и он начал читать подряд, стихотворение за стихотворением, и забыл, где он, и щеки у него разгорелись. Дважды он закрывал книгу и, придерживая страницу пальцем, еще раз смотрел имя автора. Свинберн! Надо запомнить. У этого малого глаза на месте, он все видел как надо – и цвет и сверкающий свет. Кто же такой этот Свинберн? Давным-давно помер, как почти все поэты? Или еще живой, пишет? Он поглядел на титульный лист. Да, у Свинберна есть и другие книги. Что ж, утром первым делом надо сходить в библиотеку, разжиться его книжицами. Парень опять погрузился в чтение и забыл обо всем на свете. Он не заметил, что в комнату вошла молодая женщина.",
  colums = 10;
printHead();
const ALPH = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя",
  LENGTH = TEXT.length;
let text = TEXT.toLowerCase();
const rows = Math.ceil(LENGTH / 10),
  symbolsToAdd = 10 - (LENGTH % 10);
for (let t = 0; t < symbolsToAdd; t++) text += "!";
let c = 0,
  textArr = [];
for (let t = 0; t < rows; t++) {
  textArr[t] = [];
  for (let e = 0; e < 10; e++) textArr[t][e] = text.charAt(c++);
}
function encrypt(t) {
  let e = "";
  for (let r = 0; r < t[0].length; r++)
    for (let n = 0; n < t.length; n++) e += t[r][n];
}
function printMatrix(t) {
  let e = "";
  for (let r = 0; r < t.length; r++) {
    e += "<tr>";
    for (let n = 0; n < t[r].length; n++) e += `<td>${t[r][n]}</td>`;
    e += "</tr>";
  }
  return e;
}
function printHead() {
  let t = "";
  for (let e = 0; e < 10; e++) t += `<th>${e}</th>`;
  document.querySelector(".tableHeadInput").innerHTML = t;
}
(document.querySelector(".tableInput").innerHTML += printMatrix(textArr)),
  encrypt(),
  (document.querySelector(".encrypt").innerHTML = printMatrix(
    encrypt(textArr)
  ));
